while True: #Цикл While.
  знак = input('\n Виберіть символ(+, -, *, /, **): ') #Просить вибрати дію.

  a = float(input("\n Введіть перше число: ")) #Просить ввести перше число.
  b = float(input(" Введіть друге число: ")) #Просить ввести друге число.

  if знак == "+": #Якщо знак "+"
      print("\n Результат: " + str(a + b)) #Результат

  elif знак == "-": #Якщо знак "-"
      print("\n Результат: " + str(a - b)) #Результат

  elif знак == "*": #Якщо знак "*"
      print("\n Результат: " + str(a * b)) #Результат

  elif знак == "**": #Якщо знак "**"
      print("\n Результат: " + str(a ** b)) #Результат

  elif знак == "/": #Якщо знак "/"
    if b: #Якщо змінна "b" не дорівнює 0.
      print("\n Результат: " + str(a / b)) #Результат
    else: #Якщо змінна "b" = 0.
      print("\n На 0 ділити не можна!") #Якщо змінна "b" = 0.

  else: #Якщо змінна "знак" не є "+, -, *, **, /"
      print("\n Вибрано неправильний символ!") #Якщо неправильно вибрана дія висвічує це повідомлення.

# \n = переносить рядок на один ряд вниз.