while (True): #Цикл while, щоб код пахав весь час.

    алфавіт = 'abcdfghijklmnopqrstuvwxyz' 'абвгґдеєжзиійїклмнопрстуфхцчшщьюя' '12345678901234567890' #Алфавіт.
    повідомлення = input("\n [!] Повідомлення, яке потрібно зашифувати: ") #Сюди вводиться текст, який буде зашифрований.

    ключ = 1 #Ключ.
    повідомлення = повідомлення.lower()  #lower() = робить великі букви малими.
    зашифроване_повідомлення = "" #Зберігає в собі зашифроване повідомлення.

    for letter in повідомлення: #Цикл for.
        position = алфавіт.find(letter) #Шукає букви з алфавіту.
        newPosition = position + ключ #Букви + ключ.

        if letter in алфавіт: #if.
            зашифроване_повідомлення = зашифроване_повідомлення + алфавіт[newPosition] #Робиться шифрування повідомлення.

        else: #else.
            зашифроване_повідомлення = зашифроване_повідомлення + letter #Робиться шифрування повідомлення.

    print("\n [!] Ваше зашифроване повідомлення: ", зашифроване_повідомлення) #Виводить зашифроване повідолмення.